Tekla Open API Reference for Tekla Structures 2025
DrawingObject.Attributes Property
 Gets or sets the attributes of the current object. Only attributes of the same type as the object are allowed.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AttributesBase Attributes { get; set; }
Public Property Attributes As AttributesBase
	Get
	Set
Property Value
Type: AttributesBase
See Also
Reference
DrawingObject Class
Tekla.Structures.Drawing Namespace